---
kind: property
id: P:Autodesk.Revit.DB.SolidOptions.MaterialId
source: html/c82e435c-071d-fd93-4b09-e629823dcbdc.htm
---
# Autodesk.Revit.DB.SolidOptions.MaterialId Property

Defines the material id for the Solid.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null